{
  "class_name": "Sequential", 
  "keras_version": "2.0.4", 
  "config": [
    {
      "class_name": "Conv2D", 
      "config": {
        "kernel_initializer": {
          "class_name": "VarianceScaling", 
          "config": {
            "distribution": "uniform", 
            "scale": 1.0, 
            "seed": null, 
            "mode": "fan_avg"
          }
        }, 
        "name": "conv2d_1", 
        "kernel_constraint": null, 
        "bias_regularizer": null, 
        "bias_constraint": null, 
        "dtype": "float32", 
        "activation": "relu", 
        "trainable": true, 
        "data_format": "channels_last", 
        "filters": 12, 
        "padding": "same", 
        "strides": [
          1, 
          1
        ], 
        "dilation_rate": [
          1, 
          1
        ], 
        "kernel_regularizer": {
          "class_name": "L1L2", 
          "config": {
            "l2": 9.999999747378752e-05, 
            "l1": 0.0
          }
        }, 
        "bias_initializer": {
          "class_name": "Zeros", 
          "config": {}
        }, 
        "batch_input_shape": [
          null, 
          512, 
          512, 
          1
        ], 
        "use_bias": true, 
        "activity_regularizer": null, 
        "kernel_size": [
          5, 
          5
        ]
      }
    }, 
    {
      "class_name": "MaxPooling2D", 
      "config": {
        "name": "max_pooling2d_1", 
        "trainable": true, 
        "data_format": "channels_last", 
        "pool_size": [
          2, 
          2
        ], 
        "padding": "valid", 
        "strides": [
          2, 
          2
        ]
      }
    }, 
    {
      "class_name": "Conv2D", 
      "config": {
        "kernel_constraint": null, 
        "kernel_initializer": {
          "class_name": "VarianceScaling", 
          "config": {
            "distribution": "uniform", 
            "scale": 1.0, 
            "seed": null, 
            "mode": "fan_avg"
          }
        }, 
        "name": "conv2d_2", 
        "bias_regularizer": null, 
        "bias_constraint": null, 
        "activation": "relu", 
        "trainable": true, 
        "data_format": "channels_last", 
        "padding": "same", 
        "strides": [
          1, 
          1
        ], 
        "dilation_rate": [
          1, 
          1
        ], 
        "kernel_regularizer": {
          "class_name": "L1L2", 
          "config": {
            "l2": 9.999999747378752e-05, 
            "l1": 0.0
          }
        }, 
        "filters": 24, 
        "bias_initializer": {
          "class_name": "Zeros", 
          "config": {}
        }, 
        "use_bias": true, 
        "activity_regularizer": null, 
        "kernel_size": [
          5, 
          5
        ]
      }
    }, 
    {
      "class_name": "MaxPooling2D", 
      "config": {
        "name": "max_pooling2d_2", 
        "trainable": true, 
        "data_format": "channels_last", 
        "pool_size": [
          2, 
          2
        ], 
        "padding": "valid", 
        "strides": [
          2, 
          2
        ]
      }
    }, 
    {
      "class_name": "Conv2D", 
      "config": {
        "kernel_constraint": null, 
        "kernel_initializer": {
          "class_name": "VarianceScaling", 
          "config": {
            "distribution": "uniform", 
            "scale": 1.0, 
            "seed": null, 
            "mode": "fan_avg"
          }
        }, 
        "name": "conv2d_3", 
        "bias_regularizer": null, 
        "bias_constraint": null, 
        "activation": "relu", 
        "trainable": true, 
        "data_format": "channels_last", 
        "padding": "same", 
        "strides": [
          1, 
          1
        ], 
        "dilation_rate": [
          1, 
          1
        ], 
        "kernel_regularizer": {
          "class_name": "L1L2", 
          "config": {
            "l2": 9.999999747378752e-05, 
            "l1": 0.0
          }
        }, 
        "filters": 24, 
        "bias_initializer": {
          "class_name": "Zeros", 
          "config": {}
        }, 
        "use_bias": true, 
        "activity_regularizer": null, 
        "kernel_size": [
          3, 
          3
        ]
      }
    }, 
    {
      "class_name": "Conv2D", 
      "config": {
        "kernel_constraint": null, 
        "kernel_initializer": {
          "class_name": "VarianceScaling", 
          "config": {
            "distribution": "uniform", 
            "scale": 1.0, 
            "seed": null, 
            "mode": "fan_avg"
          }
        }, 
        "name": "conv2d_4", 
        "bias_regularizer": null, 
        "bias_constraint": null, 
        "activation": "relu", 
        "trainable": true, 
        "data_format": "channels_last", 
        "padding": "same", 
        "strides": [
          1, 
          1
        ], 
        "dilation_rate": [
          1, 
          1
        ], 
        "kernel_regularizer": {
          "class_name": "L1L2", 
          "config": {
            "l2": 9.999999747378752e-05, 
            "l1": 0.0
          }
        }, 
        "filters": 24, 
        "bias_initializer": {
          "class_name": "Zeros", 
          "config": {}
        }, 
        "use_bias": true, 
        "activity_regularizer": null, 
        "kernel_size": [
          3, 
          3
        ]
      }
    }, 
    {
      "class_name": "Conv2D", 
      "config": {
        "kernel_constraint": null, 
        "kernel_initializer": {
          "class_name": "VarianceScaling", 
          "config": {
            "distribution": "uniform", 
            "scale": 1.0, 
            "seed": null, 
            "mode": "fan_avg"
          }
        }, 
        "name": "conv2d_5", 
        "bias_regularizer": null, 
        "bias_constraint": null, 
        "activation": "relu", 
        "trainable": true, 
        "data_format": "channels_last", 
        "padding": "same", 
        "strides": [
          1, 
          1
        ], 
        "dilation_rate": [
          1, 
          1
        ], 
        "kernel_regularizer": {
          "class_name": "L1L2", 
          "config": {
            "l2": 9.999999747378752e-05, 
            "l1": 0.0
          }
        }, 
        "filters": 24, 
        "bias_initializer": {
          "class_name": "Zeros", 
          "config": {}
        }, 
        "use_bias": true, 
        "activity_regularizer": null, 
        "kernel_size": [
          1, 
          1
        ]
      }
    }, 
    {
      "class_name": "MaxPooling2D", 
      "config": {
        "name": "max_pooling2d_3", 
        "trainable": true, 
        "data_format": "channels_last", 
        "pool_size": [
          2, 
          2
        ], 
        "padding": "valid", 
        "strides": [
          2, 
          2
        ]
      }
    }, 
    {
      "class_name": "Conv2D", 
      "config": {
        "kernel_constraint": null, 
        "kernel_initializer": {
          "class_name": "VarianceScaling", 
          "config": {
            "distribution": "uniform", 
            "scale": 1.0, 
            "seed": null, 
            "mode": "fan_avg"
          }
        }, 
        "name": "conv2d_6", 
        "bias_regularizer": null, 
        "bias_constraint": null, 
        "activation": "relu", 
        "trainable": true, 
        "data_format": "channels_last", 
        "padding": "same", 
        "strides": [
          1, 
          1
        ], 
        "dilation_rate": [
          1, 
          1
        ], 
        "kernel_regularizer": {
          "class_name": "L1L2", 
          "config": {
            "l2": 9.999999747378752e-05, 
            "l1": 0.0
          }
        }, 
        "filters": 32, 
        "bias_initializer": {
          "class_name": "Zeros", 
          "config": {}
        }, 
        "use_bias": true, 
        "activity_regularizer": null, 
        "kernel_size": [
          3, 
          3
        ]
      }
    }, 
    {
      "class_name": "Conv2D", 
      "config": {
        "kernel_constraint": null, 
        "kernel_initializer": {
          "class_name": "VarianceScaling", 
          "config": {
            "distribution": "uniform", 
            "scale": 1.0, 
            "seed": null, 
            "mode": "fan_avg"
          }
        }, 
        "name": "conv2d_7", 
        "bias_regularizer": null, 
        "bias_constraint": null, 
        "activation": "relu", 
        "trainable": true, 
        "data_format": "channels_last", 
        "padding": "same", 
        "strides": [
          1, 
          1
        ], 
        "dilation_rate": [
          1, 
          1
        ], 
        "kernel_regularizer": {
          "class_name": "L1L2", 
          "config": {
            "l2": 9.999999747378752e-05, 
            "l1": 0.0
          }
        }, 
        "filters": 32, 
        "bias_initializer": {
          "class_name": "Zeros", 
          "config": {}
        }, 
        "use_bias": true, 
        "activity_regularizer": null, 
        "kernel_size": [
          3, 
          3
        ]
      }
    }, 
    {
      "class_name": "Conv2D", 
      "config": {
        "kernel_constraint": null, 
        "kernel_initializer": {
          "class_name": "VarianceScaling", 
          "config": {
            "distribution": "uniform", 
            "scale": 1.0, 
            "seed": null, 
            "mode": "fan_avg"
          }
        }, 
        "name": "conv2d_8", 
        "bias_regularizer": null, 
        "bias_constraint": null, 
        "activation": "relu", 
        "trainable": true, 
        "data_format": "channels_last", 
        "padding": "same", 
        "strides": [
          1, 
          1
        ], 
        "dilation_rate": [
          1, 
          1
        ], 
        "kernel_regularizer": {
          "class_name": "L1L2", 
          "config": {
            "l2": 9.999999747378752e-05, 
            "l1": 0.0
          }
        }, 
        "filters": 32, 
        "bias_initializer": {
          "class_name": "Zeros", 
          "config": {}
        }, 
        "use_bias": true, 
        "activity_regularizer": null, 
        "kernel_size": [
          1, 
          1
        ]
      }
    }, 
    {
      "class_name": "MaxPooling2D", 
      "config": {
        "name": "max_pooling2d_4", 
        "trainable": true, 
        "data_format": "channels_last", 
        "pool_size": [
          2, 
          2
        ], 
        "padding": "valid", 
        "strides": [
          2, 
          2
        ]
      }
    }, 
    {
      "class_name": "Conv2D", 
      "config": {
        "kernel_constraint": null, 
        "kernel_initializer": {
          "class_name": "VarianceScaling", 
          "config": {
            "distribution": "uniform", 
            "scale": 1.0, 
            "seed": null, 
            "mode": "fan_avg"
          }
        }, 
        "name": "conv2d_9", 
        "bias_regularizer": null, 
        "bias_constraint": null, 
        "activation": "relu", 
        "trainable": true, 
        "data_format": "channels_last", 
        "padding": "same", 
        "strides": [
          1, 
          1
        ], 
        "dilation_rate": [
          1, 
          1
        ], 
        "kernel_regularizer": {
          "class_name": "L1L2", 
          "config": {
            "l2": 9.999999747378752e-05, 
            "l1": 0.0
          }
        }, 
        "filters": 32, 
        "bias_initializer": {
          "class_name": "Zeros", 
          "config": {}
        }, 
        "use_bias": true, 
        "activity_regularizer": null, 
        "kernel_size": [
          3, 
          3
        ]
      }
    }, 
    {
      "class_name": "Conv2D", 
      "config": {
        "kernel_constraint": null, 
        "kernel_initializer": {
          "class_name": "VarianceScaling", 
          "config": {
            "distribution": "uniform", 
            "scale": 1.0, 
            "seed": null, 
            "mode": "fan_avg"
          }
        }, 
        "name": "conv2d_10", 
        "bias_regularizer": null, 
        "bias_constraint": null, 
        "activation": "relu", 
        "trainable": true, 
        "data_format": "channels_last", 
        "padding": "same", 
        "strides": [
          1, 
          1
        ], 
        "dilation_rate": [
          1, 
          1
        ], 
        "kernel_regularizer": {
          "class_name": "L1L2", 
          "config": {
            "l2": 9.999999747378752e-05, 
            "l1": 0.0
          }
        }, 
        "filters": 32, 
        "bias_initializer": {
          "class_name": "Zeros", 
          "config": {}
        }, 
        "use_bias": true, 
        "activity_regularizer": null, 
        "kernel_size": [
          3, 
          3
        ]
      }
    }, 
    {
      "class_name": "Conv2D", 
      "config": {
        "kernel_constraint": null, 
        "kernel_initializer": {
          "class_name": "VarianceScaling", 
          "config": {
            "distribution": "uniform", 
            "scale": 1.0, 
            "seed": null, 
            "mode": "fan_avg"
          }
        }, 
        "name": "conv2d_11", 
        "bias_regularizer": null, 
        "bias_constraint": null, 
        "activation": "relu", 
        "trainable": true, 
        "data_format": "channels_last", 
        "padding": "same", 
        "strides": [
          1, 
          1
        ], 
        "dilation_rate": [
          1, 
          1
        ], 
        "kernel_regularizer": {
          "class_name": "L1L2", 
          "config": {
            "l2": 9.999999747378752e-05, 
            "l1": 0.0
          }
        }, 
        "filters": 32, 
        "bias_initializer": {
          "class_name": "Zeros", 
          "config": {}
        }, 
        "use_bias": true, 
        "activity_regularizer": null, 
        "kernel_size": [
          1, 
          1
        ]
      }
    }, 
    {
      "class_name": "MaxPooling2D", 
      "config": {
        "name": "max_pooling2d_5", 
        "trainable": true, 
        "data_format": "channels_last", 
        "pool_size": [
          2, 
          2
        ], 
        "padding": "valid", 
        "strides": [
          2, 
          2
        ]
      }
    }, 
    {
      "class_name": "Conv2D", 
      "config": {
        "kernel_constraint": null, 
        "kernel_initializer": {
          "class_name": "VarianceScaling", 
          "config": {
            "distribution": "uniform", 
            "scale": 1.0, 
            "seed": null, 
            "mode": "fan_avg"
          }
        }, 
        "name": "conv2d_12", 
        "bias_regularizer": null, 
        "bias_constraint": null, 
        "activation": "relu", 
        "trainable": true, 
        "data_format": "channels_last", 
        "padding": "valid", 
        "strides": [
          1, 
          1
        ], 
        "dilation_rate": [
          1, 
          1
        ], 
        "kernel_regularizer": {
          "class_name": "L1L2", 
          "config": {
            "l2": 9.999999747378752e-05, 
            "l1": 0.0
          }
        }, 
        "filters": 32, 
        "bias_initializer": {
          "class_name": "Zeros", 
          "config": {}
        }, 
        "use_bias": true, 
        "activity_regularizer": null, 
        "kernel_size": [
          3, 
          3
        ]
      }
    }, 
    {
      "class_name": "Conv2D", 
      "config": {
        "kernel_constraint": null, 
        "kernel_initializer": {
          "class_name": "VarianceScaling", 
          "config": {
            "distribution": "uniform", 
            "scale": 1.0, 
            "seed": null, 
            "mode": "fan_avg"
          }
        }, 
        "name": "conv2d_13", 
        "bias_regularizer": null, 
        "bias_constraint": null, 
        "activation": "relu", 
        "trainable": true, 
        "data_format": "channels_last", 
        "padding": "valid", 
        "strides": [
          1, 
          1
        ], 
        "dilation_rate": [
          1, 
          1
        ], 
        "kernel_regularizer": {
          "class_name": "L1L2", 
          "config": {
            "l2": 9.999999747378752e-05, 
            "l1": 0.0
          }
        }, 
        "filters": 32, 
        "bias_initializer": {
          "class_name": "Zeros", 
          "config": {}
        }, 
        "use_bias": true, 
        "activity_regularizer": null, 
        "kernel_size": [
          3, 
          3
        ]
      }
    }, 
    {
      "class_name": "Conv2D", 
      "config": {
        "kernel_constraint": null, 
        "kernel_initializer": {
          "class_name": "VarianceScaling", 
          "config": {
            "distribution": "uniform", 
            "scale": 1.0, 
            "seed": null, 
            "mode": "fan_avg"
          }
        }, 
        "name": "conv2d_14", 
        "bias_regularizer": null, 
        "bias_constraint": null, 
        "activation": "relu", 
        "trainable": true, 
        "data_format": "channels_last", 
        "padding": "valid", 
        "strides": [
          1, 
          1
        ], 
        "dilation_rate": [
          1, 
          1
        ], 
        "kernel_regularizer": {
          "class_name": "L1L2", 
          "config": {
            "l2": 9.999999747378752e-05, 
            "l1": 0.0
          }
        }, 
        "filters": 32, 
        "bias_initializer": {
          "class_name": "Zeros", 
          "config": {}
        }, 
        "use_bias": true, 
        "activity_regularizer": null, 
        "kernel_size": [
          1, 
          1
        ]
      }
    }, 
    {
      "class_name": "MaxPooling2D", 
      "config": {
        "name": "max_pooling2d_6", 
        "trainable": true, 
        "data_format": "channels_last", 
        "pool_size": [
          2, 
          2
        ], 
        "padding": "valid", 
        "strides": [
          2, 
          2
        ]
      }
    }, 
    {
      "class_name": "GlobalAveragePooling2D", 
      "config": {
        "trainable": true, 
        "name": "global_average_pooling2d_1", 
        "data_format": "channels_last"
      }
    }, 
    {
      "class_name": "Dropout", 
      "config": {
        "rate": 0.2, 
        "trainable": true, 
        "name": "dropout_1"
      }
    }, 
    {
      "class_name": "Dense", 
      "config": {
        "kernel_initializer": {
          "class_name": "VarianceScaling", 
          "config": {
            "distribution": "uniform", 
            "scale": 1.0, 
            "seed": null, 
            "mode": "fan_avg"
          }
        }, 
        "name": "dense_1", 
        "kernel_constraint": null, 
        "bias_regularizer": {
          "class_name": "L1L2", 
          "config": {
            "l2": 9.999999747378752e-05, 
            "l1": 0.0
          }
        }, 
        "bias_constraint": null, 
        "activation": "relu", 
        "trainable": true, 
        "kernel_regularizer": {
          "class_name": "L1L2", 
          "config": {
            "l2": 9.999999747378752e-05, 
            "l1": 0.0
          }
        }, 
        "bias_initializer": {
          "class_name": "Zeros", 
          "config": {}
        }, 
        "units": 12, 
        "use_bias": true, 
        "activity_regularizer": null
      }
    }, 
    {
      "class_name": "Dropout", 
      "config": {
        "rate": 0.1, 
        "trainable": true, 
        "name": "dropout_2"
      }
    }, 
    {
      "class_name": "Dense", 
      "config": {
        "kernel_initializer": {
          "class_name": "VarianceScaling", 
          "config": {
            "distribution": "uniform", 
            "scale": 1.0, 
            "seed": null, 
            "mode": "fan_avg"
          }
        }, 
        "name": "dense_2", 
        "kernel_constraint": null, 
        "bias_regularizer": {
          "class_name": "L1L2", 
          "config": {
            "l2": 9.999999747378752e-05, 
            "l1": 0.0
          }
        }, 
        "bias_constraint": null, 
        "activation": "softmax", 
        "trainable": true, 
        "kernel_regularizer": {
          "class_name": "L1L2", 
          "config": {
            "l2": 9.999999747378752e-05, 
            "l1": 0.0
          }
        }, 
        "bias_initializer": {
          "class_name": "Zeros", 
          "config": {}
        }, 
        "units": 4, 
        "use_bias": true, 
        "activity_regularizer": null
      }
    }
  ], 
  "backend": "tensorflow"
}